#+TITLE: Live-DEMO 用投影片
#+AUTHOR: coldnew
#+EMAIL: coldnew.tw@gmail.com
#+DATE: <2017-08-04 Fri 23:13>
#+LaTeX_CLASS: coscup2017-article

#+INFOJS_OPT: view:info toc:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://raw.githubusercontent.com/SebastianRose/org-info-js/master/stylesheet.css"/>

#+SEQ_TODO: TODO | DONE
#+STARTUP: logdone
#+OPTIONS: toc:nil num:nil ^:t

#+LINK: org-mode     http://orgmode.org
#+LINK: spacemacs    https://github.com/syl20bnr/spacemacs
#+LINK: emacs        https://www.gnu.org/s/emacs/

** 表格 (試算表)
:MANUAL:
http://orgmode.org/worg/org-tutorials/org-spreadsheet-intro.html
:END:

[[org-mode][org-mode]] 的表格也具有試算表的功能，游標移動到 #+TBLFM: 後，使用 =C-c C-c= 看看

#+NAME: fruit_expand
| 名稱 | 單價 (NT) | 數量 | 花費 |
|------+-----------+------+------|
| 蘋果 |       5.0 |  3.0 |      |
| 香蕉 |      20.0 | 10.0 |      |
| 鳳梨 |     100.0 |  2.0 |      |
|------+-----------+------+------|
| 總價 |           |      |      |
#+TBLFM: $4=$2*$3::@5$4=vsum(@2$4..@3$4)

** 匯出成 Latex -> PDF

使用 =M-x org-latex-export-to-pdf= 轉換成 PDF

在 =~/.emacs.d= 裡面要加入以下設置

#+BEGIN_SRC emacs-lisp
  ;; This buffer is for text that is not saved, and for Lisp evaluation.
  ;; To create a file, visit it with <open> and enter text in its buffer.
  (require 'ox-latex)

  (setq org-latex-pdf-process
        (if (executable-find "latexmk")
            '("latexmk -pdflatex=xelatex -pdf -silent --shell-escape -f %f")
            '("xelatex -interaction nonstopmode --shell-escape %f"
              "xelatex -interaction nonstopmode --shell-escape %f")))

  ;; To use this, add following to your org-mode file
  ;;
  ;;    #+LaTeX_CLASS: coscup2017-article
  ;;
  (add-to-list 'org-latex-classes
               '("coscup2017-article"
                 "\\documentclass[12pt,a4paper]{article}
                  \\usepackage[T1]{fontenc}
                  \\usepackage{fontspec}
                  \\usepackage{xeCJK}
                  \\setCJKmainfont{Hiragino Sans GB W3}
                  \\XeTeXlinebreaklocale \"zh\"
                  \\XeTeXlinebreakskip = 0pt plus 1pt
                  \\usepackage{graphicx}
                  \\usepackage{tikz}
                  \\usepackage[bookmarks=true,colorlinks,urlcolor=blue]{hyperref}
                  \\defaultfontfeatures{Mapping=tex-text}
                  \\setmonofont[Scale=0.8]{Monaco}
                  \\usepackage{geometry}
                  \\usepackage{minted}
                  \\usemintedstyle{emacs}
                  \\geometry{a4paper, textwidth=6.5in, textheight=8in,
                              marginparsep=10pt, marginparwidth=.6in}
                  \\pagestyle{plain}
                  \\linespread{1.5}
                  \\title{}
                        [NO-DEFAULT-PACKAGES]
                        [NO-PACKAGES]"
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph*{%s}")
                 ))


  (add-to-list 'org-latex-packages-alist '("" "minted"))
  (setq org-latex-listings 'minted)
  (setq org-latex-minted-options
        '(("frame" "lines")
          ("fontsize" "\\scriptsize")
          ("linenos" "true")))
#+END_SRC

#+RESULTS:
| frame    | lines       |
| fontsize | \scriptsize |
| linenos  | true        |

